Importing Libraries

In [1]:
import pandas as pd
import numpy as np

Importing DataFrame

In [2]:
df = pd.read_excel('df_missing_values.xlsx', parse_dates=['timestamp'], index_col=[0]) 
df

#parse_dates parameter convince pandas to turn things into real datetime types
#index_col=[0] -> marking 1st column as index column
#DataFrame is 2D labeled data structure with columns of different types

   one  two  three four   five  timestamp
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  3.0   -5    104  bar   True 2016-01-01

In [3]:
df1 = pd.read_excel('df_missing_values.xlsx')
df1

#not marked as index so index takes automatic values

  Unnamed: 0  one  two  three four   five  timestamp
0          a  0.0   10   -151  bar   True 2012-05-05
1          c -1.0   15   -217  bar  False 2013-01-01
2          e  0.5  -20     86  bar   True 2012-03-03
3          f -2.0    0    107  bar  False 2014-01-01
4          h  3.0   -5    104  bar   True 2016-01-01

In [4]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df['one']
#Series is 1D labeled array capable of holding any data type

a    0.0
c   -1.0
e    0.5
f   -2.0
h    3.0
Name: one, dtype: float64

In [5]:
type(df['one'])

pandas.core.series.Series

Subsetting DF by index

In [105]:
df.loc['a']
#loc -> Access a group of rows and columns by label

one                            0
two                           10
three                       -151
four                         bar
five                        True
timestamp    2012-05-05 00:00:00
Name: a, dtype: object

In [107]:
df.loc[['a','c','h']]

   one  two  three four   five  timestamp
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
h  3.0   -5    104  bar   True 2016-01-01

Subsetting DF by columns

In [111]:
df[['one','timestamp']]

   one  timestamp
a  0.0 2012-05-05
c -1.0 2013-01-01
e  0.5 2012-03-03
f -2.0 2014-01-01
h  3.0 2016-01-01

Subsetting by index and column

In [99]:
df.loc['h','three']

104

In [112]:
df.loc[['c'],['one','timestamp']]

   one  timestamp
c -1.0 2013-01-01

In [20]:
df.loc[['a','c','h'],['one','timestamp']]

   one  timestamp
a  0.0 2012-05-05
c -1.0 2013-01-01
h  3.0 2016-01-01

In [113]:
df.loc[:,['one','timestamp']]

   one  timestamp
a  0.0 2012-05-05
c -1.0 2013-01-01
e  0.5 2012-03-03
f -2.0 2014-01-01
h  3.0 2016-01-01

Missing values in Data Frame

In [6]:
df.loc[['a','c','h'],['one','timestamp']]=np.nan
df

#assigning values associated with these rows/columns NaN values

   one  two  three four   five  timestamp
a  NaN   10   -151  bar   True        NaT
c  NaN   15   -217  bar  False        NaT
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  NaN   -5    104  bar   True        NaT

Check missing values in DF

In [23]:
df.isnull()

     one    two  three   four   five  timestamp
a   True  False  False  False  False       True
c   True  False  False  False  False       True
e  False  False  False  False  False      False
f  False  False  False  False  False      False
h   True  False  False  False  False       True

In [24]:
df.isnull().sum()

one          3
two          0
three        0
four         0
five         0
timestamp    3
dtype: int64

In [25]:
df.notnull().sum()

one          2
two          5
three        5
four         5
five         5
timestamp    2
dtype: int64

#### Nan vs None

In [26]:
#NaN can be used as a numerical value, None is Python type (NoneType) and would be more like "inexistent" or "empty"
#NaN and None are different data types in Python
#when it comes to missing values detection and elimination, pandas.DataFrame treats NaN and None similarly. 

np.NaN == 0

False

In [11]:
np.NaN == None

False

In [12]:
None == 0

False

In [7]:
np.NaN == np.NaN

False

In [8]:
np.NaN is np.NaN

True

In [9]:
None == None

True

In [10]:
None is None

True

Fill NAs

In [27]:
df.fillna(0)
#this command means if this command is run then the output will look like this
#if you put inplace=True in argument it will be permanent

   one  two  three four   five            timestamp
a  0.0   10   -151  bar   True                    0
c  0.0   15   -217  bar  False                    0
e  0.5  -20     86  bar   True  2012-03-03 00:00:00
f -2.0    0    107  bar  False  2014-01-01 00:00:00
h  0.0   -5    104  bar   True                    0

In [29]:
df['one'].fillna(0)

a    0.0
c    0.0
e    0.5
f   -2.0
h    0.0
Name: one, dtype: float64

Forward Fill/Backward Fill

In [30]:
df

   one  two  three four   five  timestamp
a  NaN   10   -151  bar   True        NaT
c  NaN   15   -217  bar  False        NaT
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  NaN   -5    104  bar   True        NaT

In [31]:
df.ffill()
#fill NaN/NaT with values in previous row
#if you put inplace=True in argument, it will be permanent

   one  two  three four   five  timestamp
a  NaN   10   -151  bar   True        NaT
c  NaN   15   -217  bar  False        NaT
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h -2.0   -5    104  bar   True 2014-01-01

In [32]:
df.bfill()
#fill NaN/NaT with values below it

   one  two  three four   five  timestamp
a  0.5   10   -151  bar   True 2012-03-03
c  0.5   15   -217  bar  False 2012-03-03
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  NaN   -5    104  bar   True        NaT

In [33]:
df.bfill(limit=1)
#fill till 1 value

   one  two  three four   five  timestamp
a  NaN   10   -151  bar   True        NaT
c  0.5   15   -217  bar  False 2012-03-03
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  NaN   -5    104  bar   True        NaT

Drop NAs

In [34]:
df

   one  two  three four   five  timestamp
a  NaN   10   -151  bar   True        NaT
c  NaN   15   -217  bar  False        NaT
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  NaN   -5    104  bar   True        NaT

In [35]:
df.dropna(axis=0)
#x axis is 0
#e,f row has no missing values
#Drop the rows where at least one element is missing

   one  two  three four   five  timestamp
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01

In [36]:
df.dropna(axis=1)
#Drop the columns where at least one element is missing

   two  three four   five
a   10   -151  bar   True
c   15   -217  bar  False
e  -20     86  bar   True
f    0    107  bar  False
h   -5    104  bar   True

In [37]:
df.loc[['h'],['two']] = None
#mark particular block (h,two) as NaN

In [38]:
df

   one   two  three four   five  timestamp
a  NaN  10.0   -151  bar   True        NaT
c  NaN  15.0   -217  bar  False        NaT
e  0.5 -20.0     86  bar   True 2012-03-03
f -2.0   0.0    107  bar  False 2014-01-01
h  NaN   NaN    104  bar   True        NaT

Replace Function

In [40]:
ser = pd.Series([4,13,8,41,28])

In [41]:
ser

0     4
1    13
2     8
3    41
4    28
dtype: int64

In [42]:
ser.replace(13,5)

0     4
1     5
2     8
3    41
4    28
dtype: int64

In [43]:
ser.replace([13,41,8],['haha',98,'eight'],inplace=True)

In [44]:
ser

0        4
1     haha
2    eight
3       98
4       28
dtype: object

In [45]:
ser.replace({'haha':1,'eight':8})

0     4
1     1
2     8
3    98
4    28
dtype: int64

Replacing values in DF

In [48]:
df=pd.DataFrame({'a':[10,20,30,40,50],'b':[11,12,13,14,15]})

In [49]:
df

    a   b
0  10  11
1  20  12
2  30  13
3  40  14
4  50  15

In [51]:
df.replace([10,50],1000)

      a   b
0  1000  11
1    20  12
2    30  13
3    40  14
4  1000  15

In [53]:
df.replace([20,14],[1000,2000])

      a     b
0    10    11
1  1000    12
2    30    13
3    40  2000
4    50    15

In [54]:
df.replace({'b':[15]},1000)

    a     b
0  10    11
1  20    12
2  30    13
3  40    14
4  50  1000

In [55]:
df.replace([30,40],method='ffill')

    a   b
0  10  11
1  20  12
2  20  13
3  20  14
4  50  15

In [57]:
df.replace([30,40],method='bfill')

    a   b
0  10  11
1  20  12
2  50  13
3  50  14
4  50  15

Column Renaming

In [5]:
df

   one  two  three four   five  timestamp
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  3.0   -5    104  bar   True 2016-01-01

In [4]:
df.rename(columns={"one":1,"two":2})

     1   2  three four   five  timestamp
a  0.0  10   -151  bar   True 2012-05-05
c -1.0  15   -217  bar  False 2013-01-01
e  0.5 -20     86  bar   True 2012-03-03
f -2.0   0    107  bar  False 2014-01-01
h  3.0  -5    104  bar   True 2016-01-01

In [7]:
df.rename(columns=lambda x:x.upper(),inplace=True)
df

   ONE  TWO  THREE FOUR   FIVE  TIMESTAMP
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  3.0   -5    104  bar   True 2016-01-01

In [8]:
df.rename(columns=lambda x:x.lower())

   one  two  three four   five  timestamp
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  3.0   -5    104  bar   True 2016-01-01

Functions

In [9]:
def function_name(Parameters): #Formal Parameter
    print(Parameters)

In [10]:
function_name(1) #Actual Parameter

1

In [11]:
function_name("Hello")

Hello

In [12]:
def sample_func(x):
    return x*5

In [14]:
return_val=sample_func(4)
return_val

20

In [15]:
def sq_cu(m):
    print("Square: ", m**2)
    print("Cube: ", m**3)

In [16]:
sq_cu(5)

Square:  25
Cube:  125

Functions on Data Frames

In [23]:
df

   one  two  three four   five  timestamp
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  3.0   -5    104  bar   True 2016-01-01

In [24]:
def df_modifier(df3):
    return df3.rename(columns={"one":"ONE","two":"TWO"})

df_modifier(df)

   ONE  TWO  three four   five  timestamp
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  3.0   -5    104  bar   True 2016-01-01

In [13]:
def dataframe_modifier(df3):
    return df3.rename(columns = lambda x: x.upper())

dataframe_modifier(df)

   ONE  TWO  THREE FOUR   FIVE  TIMESTAMP
a  NaN   10   -151  bar   True        NaT
c  NaN   15   -217  bar  False        NaT
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  NaN   -5    104  bar   True        NaT

### Group By

In [25]:
df

   one  two  three four   five  timestamp
a  0.0   10   -151  bar   True 2012-05-05
c -1.0   15   -217  bar  False 2013-01-01
e  0.5  -20     86  bar   True 2012-03-03
f -2.0    0    107  bar  False 2014-01-01
h  3.0   -5    104  bar   True 2016-01-01

In [26]:
df2=df.copy()

In [28]:
df2=df.copy(deep=True) #creates new ram allocation for df2 with same size df
df2.four="bar_2" #changing values of column four

df3= df2.append(df,ignore_index=True)
df3

   one  two  three   four   five  timestamp
0  0.0   10   -151  bar_2   True 2012-05-05
1 -1.0   15   -217  bar_2  False 2013-01-01
2  0.5  -20     86  bar_2   True 2012-03-03
3 -2.0    0    107  bar_2  False 2014-01-01
4  3.0   -5    104  bar_2   True 2016-01-01
5  0.0   10   -151    bar   True 2012-05-05
6 -1.0   15   -217    bar  False 2013-01-01
7  0.5  -20     86    bar   True 2012-03-03
8 -2.0    0    107    bar  False 2014-01-01
9  3.0   -5    104    bar   True 2016-01-01

In [29]:
df3.groupby(['four']).sum()
#group categorical variables into segment and use aggregate functions on it

       one  two  three  five
four
bar    0.5    0    -71   3.0
bar_2  0.5    0    -71   3.0

In [30]:
df3.groupby(['four'])['one','two'].sum()

<ipython-input-30-46f39b3e63f4>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df3.groupby(['four'])['one','two'].sum()

       one  two
four
bar    0.5    0
bar_2  0.5    0

In [32]:
df3.groupby(['four','five']).sum()

             one  two  three
four  five
bar   False -3.0   15   -110
      True   3.5  -15     39
bar_2 False -3.0   15   -110
      True   3.5  -15     39

In [33]:
df3.groupby(['four'])['one','two'].nth(1)
#group according to index. here it takes 2nd index of two segments

<ipython-input-33-03b0ff31af4e>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df3.groupby(['four'])['one','two'].nth(1)

       one  two
four
bar   -1.0   15
bar_2 -1.0   15

In [114]:
df3.groupby(['four'])['one'].sum()

four
bar      0.5
bar_2    0.5
Name: one, dtype: float64

In [34]:
#aggregate function
#same as previous problem
df3.groupby(['four']).agg({"one":"sum"})

       one
four
bar    0.5
bar_2  0.5

In [36]:
df3.groupby(['four']).agg({"one":["sum","mean","std"],"two":["sum","mean","std"]})

       one                two
       sum mean       std sum mean        std
four
bar    0.5  0.1  1.884144   0    0  13.693064
bar_2  0.5  0.1  1.884144   0    0  13.693064

Aggregate

In [120]:
#single row is a scalar value not as a data frame
#returning one single line of code, pandas cant understand, so use index 0
#if there were 3 rows.. then no need to do index 0
def max_finder(df):
    return pd.DataFrame({"one":max(df.one),"two":max(df.two),"three":max(df.three)},index=[0])

In [121]:
df3.groupby('four').apply(max_finder).reset_index()
#reset index gives level_1 if not mentioned wont show
#max finder is the dataframe 
#each of the groups will be copied into maxfinder one by one

    four  level_1  one  two  three
0    bar        0  3.0   15    107
1  bar_2        0  3.0   15    107

Groupby Function with Arguments

In [40]:
#search type will have 2 value that we can pass max and min
def min_max_finder(df,search_type):
    return pd.DataFrame({"one":search_type(df.one),"two":search_type(df.two),"three":search_type(df.three)},index=[0])

In [41]:
df3.groupby('four').apply(min_max_finder,search_type=max)

         one  two  three
four
bar   0  3.0   15    107
bar_2 0  3.0   15    107

In [42]:
df3.groupby('four').apply(min_max_finder,search_type=min)

         one  two  three
four
bar   0 -2.0  -20   -217
bar_2 0 -2.0  -20   -217

Lambda Function

In [43]:
df['condition_check_one']=df['three'].apply(lambda x:x>50)
df

   one  two  three four   five  timestamp  condition_check_one
a  0.0   10   -151  bar   True 2012-05-05                False
c -1.0   15   -217  bar  False 2013-01-01                False
e  0.5  -20     86  bar   True 2012-03-03                 True
f -2.0    0    107  bar  False 2014-01-01                 True
h  3.0   -5    104  bar   True 2016-01-01                 True

In [44]:
df['condition_check_one']=df['one'].apply(lambda x:-1 if x>0 else 1)
df

   one  two  three four   five  timestamp  condition_check_one
a  0.0   10   -151  bar   True 2012-05-05                    1
c -1.0   15   -217  bar  False 2013-01-01                    1
e  0.5  -20     86  bar   True 2012-03-03                   -1
f -2.0    0    107  bar  False 2014-01-01                    1
h  3.0   -5    104  bar   True 2016-01-01                   -1

Custom user defined funtion in lambda

In [45]:
def check(val):
    if val>0:
        return True
    else:
        return False

In [46]:
#return true or false if values in 'one' > 0
#method 1
df['condition_check_one']=df['one'].apply(check)

In [48]:
#method 2
df['condition_check_one']=df.apply(lambda x:check(x.one),axis=1)

Multiple arguments in lambda

In [53]:
def check_2(val1,val2):
    if val1>val2:
        return True
    else:
        return False

In [54]:
df['condition_check_one']=df.apply(lambda x:check_2(x.one,x.two),axis=1)
#axis 1 means column

In [55]:
df

   one  two  three four   five  timestamp  condition_check_one
a  0.0   10   -151  bar   True 2012-05-05                False
c -1.0   15   -217  bar  False 2013-01-01                False
e  0.5  -20     86  bar   True 2012-03-03                 True
f -2.0    0    107  bar  False 2014-01-01                False
h  3.0   -5    104  bar   True 2016-01-01                 True

Map

In [56]:
df3

   one  two  three   four   five  timestamp
0  0.0   10   -151  bar_2   True 2012-05-05
1 -1.0   15   -217  bar_2  False 2013-01-01
2  0.5  -20     86  bar_2   True 2012-03-03
3 -2.0    0    107  bar_2  False 2014-01-01
4  3.0   -5    104  bar_2   True 2016-01-01
5  0.0   10   -151    bar   True 2012-05-05
6 -1.0   15   -217    bar  False 2013-01-01
7  0.5  -20     86    bar   True 2012-03-03
8 -2.0    0    107    bar  False 2014-01-01
9  3.0   -5    104    bar   True 2016-01-01

In [57]:
map_dict={"bar_2":2,"bar":3}

In [58]:
map_dict

{'bar_2': 2, 'bar': 3}

In [60]:
df3['mapped']=df3['four'].map({"bar_2":2,"bar":3})
df3

   one  two  three   four   five  timestamp  mapped
0  0.0   10   -151  bar_2   True 2012-05-05       2
1 -1.0   15   -217  bar_2  False 2013-01-01       2
2  0.5  -20     86  bar_2   True 2012-03-03       2
3 -2.0    0    107  bar_2  False 2014-01-01       2
4  3.0   -5    104  bar_2   True 2016-01-01       2
5  0.0   10   -151    bar   True 2012-05-05       3
6 -1.0   15   -217    bar  False 2013-01-01       3
7  0.5  -20     86    bar   True 2012-03-03       3
8 -2.0    0    107    bar  False 2014-01-01       3
9  3.0   -5    104    bar   True 2016-01-01       3